# Типы данных - условное описание значения (целое число, дробное число, строка, список, массив и т.д.)
'''
int - целые числа (1,5,-5)
float - вещественные числа (1.5,-3.14)
str - строки 'Привет'
bool - True/False

list - списки - коллекции, в которые можно помещать данные
dict - словари - списки у которых есть уникальный ключ
'''
a = 15
a = 'sadfasd'

print(a)

# Математические операции
a = 2
b = 4
c = a + b  # сумма
print(c)
c = a - b  # разница
print(c)
c = a * b  # умножение
print(c)
c = a ** b  # степень
print(c)
c = a / b  # деление
print(c)
c = a // b  # целая часть от деления
print(c)
c = a % b  # остаток от деления
print(c)


